COLP.BEPS.Servicios.PrestacionesEconomicas.BL/src/main/java/co/gov/colpensiones/beps/beneficios/businesslogic/Beneficios.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://www.colpensiones.gov.co/beps/contracts/1.0/comun" xmlns:com1="http://www.colpensiones.gov.co/beps/schemas/1.0/comun" xmlns:pres="http://www.colpensiones.gov.co/beps/contracts/1.0/prestacioneseconomicas" xmlns:pres1="http://www.colpensiones.gov.co/beps/schemas/1.0/prestacioneseconomicas" xmlns:per="http://www.colpensiones.gov.co/beps/schemas/1.0/personas">
   <soapenv:Header>
      <com:informacionContexto>
         <!--Optional:-->
         <com1:sistemaOrigen>01</com1:sistemaOrigen>
         <!--Optional:-->
         <com1:idCorrelacion>0</com1:idCorrelacion>
         <!--Optional:-->
         <com1:tipoProcesamiento>S</com1:tipoProcesamiento>
         <!--Optional:-->
         <com1:usuarioSistemaExterno>lleon</com1:usuarioSistemaExterno>
         <!--Optional:-->
         <com1:idPeticion>2</com1:idPeticion>
      </com:informacionContexto>
   </soapenv:Header>
   <soapenv:Body>
      <pres:informacionSolicitudDestinacionRecursos>
         <pres1:tipoSolicitud>01</pres1:tipoSolicitud>
         <pres1:fechaRegistro>20140813</pres1:fechaRegistro>
         <pres1:fechaConstanciaEjecutoria>20140812</pres1:fechaConstanciaEjecutoria>
         <pres1:trasladoSGPaBEPS>N</pres1:trasladoSGPaBEPS>
         <pres1:numeroRadicacion>20140812_0001</pres1:numeroRadicacion>
         
         <pres1:codigoCanalRadicacion>01</pres1:codigoCanalRadicacion>
         <pres1:usuarioSistemaRadicacion>LLEON</pres1:usuarioSistemaRadicacion>
         <pres1:usuarioAnalista>LLEON</pres1:usuarioAnalista>
         <pres1:usuarioRevisor>LLEON</pres1:usuarioRevisor>
         <pres1:destinacionesRecursos>
            <!--Zero or more repetitions:-->
            <pres1:destinacion>
               <pres1:codigoTipo>01</pres1:codigoTipo>
               <pres1:porcentaje>100</pres1:porcentaje>
            </pres1:destinacion>
         </pres1:destinacionesRecursos>
         <pres1:documentos>
            <!--Zero or more repetitions:-->
            <com1:documento>
               <com1:id>EDFRG43443%VDFT</com1:id>
               <com1:codigoTipoDocumental>01</com1:codigoTipoDocumental>
            </com1:documento>
         </pres1:documentos>
         <pres1:informacionVinculado>
            <pres1:identificacion>
               <!--Optional:-->
               <per:tipoDocumento>CC</per:tipoDocumento>
               <!--Optional:-->
               <per:numeroDocumento>1094882268</per:numeroDocumento>
            </pres1:identificacion>
            <pres1:departamentoNacimiento>
               <per:codigo>11</per:codigo>
            </pres1:departamentoNacimiento>
            <pres1:municipioNacimiento>
               <per:codigo>11001</per:codigo>
            </pres1:municipioNacimiento>
            <pres1:codigoAFP>01</pres1:codigoAFP>
            <pres1:autorizacionEnvioComunicacion>S</pres1:autorizacionEnvioComunicacion>
            <pres1:autorizacionManejoInformacion>S</pres1:autorizacionManejoInformacion>
            <pres1:autorizaTerminosColombiaMayor>S</pres1:autorizaTerminosColombiaMayor>
            <pres1:informacionUbicacion>
               <!--Optional:-->
               <per:direcciones>
                  <!--Zero or more repetitions:-->
                  <per:direccion>
                     <per:identificador>0</per:identificador>
                     <per:departamento>
                        <per:codigo>11</per:codigo>
                     </per:departamento>
                     <per:municipio>
                        <per:codigo>11001</per:codigo>
                     </per:municipio>
                     <per:direccion>DIRECCION # 33</per:direccion>
                     <per:esPrincipal>S</per:esPrincipal>
                  </per:direccion>
               </per:direcciones>
               <!--Optional:-->
               <per:telefonos>
                  <!--Zero or more repetitions:-->
                  <per:telefono>
                     <per:identificador>0</per:identificador>
                     <per:tipoTelefono>02</per:tipoTelefono>
                     <per:telefono>3262970</per:telefono>
                     <per:indicativoPais>57</per:indicativoPais>
                     <per:indicativoCiudad>1</per:indicativoCiudad>
                     <per:extension>3663</per:extension>
                     <per:esPrincipal>S</per:esPrincipal>
                  </per:telefono>
               </per:telefonos>
               <!--Optional:-->
               <per:correosElectronicos>
                  <!--Zero or more repetitions:-->
                  <per:correoElectronico>
                     <per:identificador>0</per:identificador>
                     <per:direccion>CORREO@HEINSOHN.COM.CO</per:direccion>
                     <per:esPrincipal>S</per:esPrincipal>
                  </per:correoElectronico>
               </per:correosElectronicos>
            </pres1:informacionUbicacion>
         </pres1:informacionVinculado>
         <pres1:informacionTercero>
            <pres1:identificacion>
               <!--Optional:-->
               <per:tipoDocumento>PA</per:tipoDocumento>
               <!--Optional:-->
               <per:numeroDocumento>320558569</per:numeroDocumento>
            </pres1:identificacion>
            <pres1:nombres>
               <per:primerApellido>GÁRCÍÁ</per:primerApellido>
               <per:segundoApellido>NÜÑÉZ</per:segundoApellido>
               <per:primerNombre>LÜÍS</per:primerNombre>
               <per:segundoNombre>FÉRNÁNDÓ</per:segundoNombre>
            </pres1:nombres>
            <pres1:tipoTercero>05</pres1:tipoTercero>
            <pres1:numeroTarjetaProfesional>4543DF334</pres1:numeroTarjetaProfesional>
            <pres1:informacionAutorizacion>
               <!--Optional:-->
               <per:autorizacionEnvioComunicacion>N</per:autorizacionEnvioComunicacion>
               <!--Optional:-->
               <per:autorizacionManejoInformacion>N</per:autorizacionManejoInformacion>
            </pres1:informacionAutorizacion>
         </pres1:informacionTercero>
      </pres:informacionSolicitudDestinacionRecursos>
   </soapenv:Body>
</soapenv:Envelope>